/***********************《现代软件工程》课程作业-----三角函数计算器**********
*************************小组成员：伏皓裕 袁龙龙 龚双林**********************
*
******************************用户输入处理模块********************************
********************************作者：伏皓裕*********************************
********************************时间：2024.4.9*******************************
*/

#ifndef __input_H__
#define __input_H__

char get_first(void);
char ang_or_rad();
char type_choice();
double data_input(char type);

#endif
